"""
Есть 2 списка телефонов: первый - список всех регистраций, второй - тех, кто подключились к игре. 
Определить список телефонов тех, кто зарегистрировался, но не начал работу на сайте.
["380669640506", "0637306465", "380961935117", "632643973", "508325200", "0000000000", "48730283918", "986223575", "375297947963"]

["380669640506", "0637306465", "632643973", "508325200", "48730283918", "986223575"]
"""

from m05_py03_v01_myphone import is_valid_phone

if __name__ == "__main__":

    registration = []

    for phone in ["380669640506", "0637306465", "380961935117", "632643973", "508325200", "0000000000", 
                    "48730283918", "986223575", "375297947963"]:
        if is_valid_phone(phone):
            registration.append(phone)

    connected = []

    for phone in ["380669640506", "0637306465", "632643973", "508325200", "48730283918", "986223575"]:
        if is_valid_phone(phone):
            connected.append(phone)

    print(registration)
    print(connected)

    result = list(set(registration) & set(connected))

    print(result)
