# False

# ( )	Скобки
# **	Возведение в степень
# +x, -x, ~x	Унарные плюс, минус и битовое отрицание
# *, /, //, %	Умножение, деления, взятие остатка
# +, -	Сложение и вычитание
# <<, >>	Битовые сдвиги
# &	Битовое И
# ^	Битовое исключающее ИЛИ (XOR)
# |	Битовое ИЛИ
# ==, !=, >, >=, <, <=, is, is not, in, not in	Сравнение, проверка идентичности, проверка вхождения
# not	Логическое НЕ
# and	Логическое И
# or	Логическое ИЛИ

print(f'(3 + 4 >= 3) == True -> answer: {(3 + 4 >= 3) == True}')
print(3 == True)
print(7 >= 3 == True)
print(7 >= 3)
